# Series

In [24]:
import pandas as pd

In [3]:
data = [1,2,3,4,5,6]

In [4]:
pd.Series(data)

0    1
1    2
2    3
3    4
4    5
5    6
dtype: int64

In [7]:
#criando os índices
index = ['linha' + str(i) for i in range(6)]

In [8]:
index

['linha0', 'linha1', 'linha2', 'linha3', 'linha4', 'linha5']

In [9]:
s = pd.Series(data = data, index = index)

In [10]:
s

linha0    1
linha1    2
linha2    3
linha3    4
linha4    5
linha5    6
dtype: int64

In [11]:
#Criando Series através de um dicionário
data = {'Linha' + str(i): i + 1 for i in range(6)}

In [12]:
data

{'Linha0': 1, 'Linha1': 2, 'Linha2': 3, 'Linha3': 4, 'Linha4': 5, 'Linha5': 6}

In [13]:
s = pd.Series(data)

In [14]:
s

Linha0    1
Linha1    2
Linha2    3
Linha3    4
Linha4    5
Linha5    6
dtype: int64

## Dataframe

In [38]:
#lista
df = [[1,2,3], 
      [4,5,6],
      [7,8,9]]
df

[[1, 2, 3], [4, 5, 6], [7, 8, 9]]

In [39]:
#Dataframe
df1 = pd.DataFrame(data = df)

In [40]:
df1

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [41]:
index = ['linha' + str(i) for i in range(3)]

In [42]:
colunas = ['coluna' + str(i) for i in range(3)]

In [45]:
df1 = pd.DataFrame(data = df, index = index, columns = colunas)
df2 = pd.DataFrame(data = df, index = index, columns = colunas)
df3 = pd.DataFrame(data = df, index = index, columns = colunas)

In [46]:
df1

        coluna0  coluna1  coluna2
linha0        1        2        3
linha1        4        5        6
linha2        7        8        9

In [47]:
df1[df1 > 0] = 'A'
df2[df2 > 0] = 'B'
df3[df3 > 0] = 'C'

## Concatenando

In [50]:
df4 = pd.concat([df1, df2, df3])

In [52]:
df4

       coluna0 coluna1 coluna2
linha0       A       A       A
linha1       A       A       A
linha2       A       A       A
linha0       B       B       B
linha1       B       B       B
linha2       B       B       B
linha0       C       C       C
linha1       C       C       C
linha2       C       C       C

In [53]:
df4 = pd.concat([df1, df2, df3], axis = 1)

In [54]:
df4

       coluna0 coluna1 coluna2 coluna0 coluna1 coluna2 coluna0 coluna1 coluna2
linha0       A       A       A       B       B       B       C       C       C
linha1       A       A       A       B       B       B       C       C       C
linha2       A       A       A       B       B       B       C       C       C

## Organizando o dataframe

In [57]:
df2 = pd.DataFrame(data = df, index = list('321'), columns = list('XYZ'))

In [58]:
df2

   X  Y  Z
3  1  2  3
2  4  5  6
1  7  8  9

In [61]:
#Ordena as linhas
df2.sort_index(inplace = True)
df2

   X  Y  Z
1  7  8  9
2  4  5  6
3  1  2  3

In [62]:
#Ordena as linhs e colunas
df2.sort_index(axis = 1)
df2

   X  Y  Z
1  7  8  9
2  4  5  6
3  1  2  3

In [64]:
#Ordena pelo nome da coluna
df2.sort_values(by='X', inplace = True)
df2
#df2.sort_values(by=['X', 'Y'], inplace = True)

   X  Y  Z
3  1  2  3
2  4  5  6
1  7  8  9

## MANIPULANDO O DATAFRAME

In [3]:
df = [(1,2,3),
      (4,5,6),
      (7,8,9),
      (10,11,12)]

df = pd.DataFrame(df, 'l1 l2 l3 l4'.split(), 'c1 c2 c3'.split())
df

    c1  c2  c3
l1   1   2   3
l2   4   5   6
l3   7   8   9
l4  10  11  12

In [4]:
#Selecionando uma coluna
df['c1']

l1     1
l2     4
l3     7
l4    10
Name: c1, dtype: int64

In [5]:
#Selecionando várias colunas
df[['c1', 'c2']]

    c1  c2
l1   1   2
l2   4   5
l3   7   8
l4  10  11

In [12]:
#Selecionando várias linhas
df[:] #df[1:3] #df[2:]

    c1  c2  c3
l1   1   2   3
l2   4   5   6
l3   7   8   9
l4  10  11  12

In [14]:
#Método loc(seleciona linhas x colunas) através da referência da linha e coluna
df.loc['l2']

c1    4
c2    5
c3    6
Name: l2, dtype: int64

In [15]:
df.loc['l2', 'c3']

6

In [19]:
df.loc[['l1', 'l2']]

    c1  c2  c3
l1   1   2   3
l2   4   5   6

In [22]:
df.loc[['l1', 'l2'], ['c2', 'c3']]

    c2  c3
l1   2   3
l2   5   6

In [17]:
#Método iloc seleciona linhas x colunas através do índice da linha e coluna
df.iloc[1]

c1    4
c2    5
c3    6
Name: l2, dtype: int64

In [18]:
df.iloc[1, 2]

6

In [23]:
df.iloc[[0, 1], [1, 2]]

    c2  c3
l1   2   3
l2   5   6

# CONTADORES

In [25]:
c = pd.Series(list('asdfasfasdfffdsafdsafesfesasdfefsadfeasdfess'))

In [28]:
#Valores únicos
c.unique()

array(['a', 's', 'd', 'f', 'e'], dtype=object)

In [26]:
#Conta quantos valores únicos existem
c.value_counts()

s    12
f    12
a     8
d     7
e     5
dtype: int64